In [1]:
import pandas as pd
import numpy as np

In [2]:
df = pd.DataFrame({
    'Name' : ['Jane', 'John', 'Ashley', 'Mike', 'Emily', 'Jack', 'Catlin', 'Mag'],
    'Ctg' : ['A', 'A', 'C', 'B', 'B', 'C', 'B', 'B'],
    'Val' : np.random.random(8).round(2),
    'Val2' : np.random.randint(1, 10, size = 8)
})
df

     Name Ctg   Val  Val2
0    Jane   A  0.99     9
1    John   A  0.72     9
2  Ashley   C  0.18     5
3    Mike   B  0.95     1
4   Emily   B  0.40     6
5    Jack   C  0.68     9
6  Catlin   B  0.66     5
7     Mag   B  0.91     7

In [4]:
pd.pivot_table(df, values=['Val', 'Val2'], index=['Ctg'], aggfunc={'Val': np.sum, 'Val2': np.average})

      Val  Val2
Ctg
A    1.71  9.00
B    2.92  4.75
C    0.86  7.00